{"_id":{"$oid":"59098cb08e2cec0db14bb99d"},"updatedAt":{"$date":"2017-05-03T07:54:24.040Z"},"createdAt":{"$date":"2017-05-03T07:54:24.040Z"},"content":"Email : tin@tin.ha\nPass : milou\n---\n1_ Un Fork est une copie d'un dépôt Github.\n2_ Ça permet d'avoir les droits d'écriture sur un projet et donc de pouvoir faire des modifications et des commits.\n3_ Éventuellement ensuite, on pourra faire une Pull Request sur le projet original, c'est à dire proposer des modifications ou des évolutions dudit projet. Le propriétaire pourra merger ou non nos modifs.\n4_ Une branche est une partie du projet sur laquelle on peut travailler sans impacter les autres branches. On créer en général une branche par fonctionnalité, que l'on merge ensuite sur la branche principale quand le résultat est satisfaisant.\n5_ Un Fork représente un projet alors qu'une branche n'en est qu'une partie. On peut avoir plusieurs branches sur un projet, les fusionner, les supprimer et continuer le projet.","title":"Exercice 1","__v":0}
{"_id":{"$oid":"59099acc8e2cec0db14bb99e"},"updatedAt":{"$date":"2017-05-03T08:54:36.421Z"},"createdAt":{"$date":"2017-05-03T08:54:36.421Z"},"title":"La MEAN stack","content":"1_ Angular est un framework JS qui facilite la manipulation du DOM, notamment grâce au data binding. Il utilise une architecture MVC (séparation entre les données, leurs présentation et les actions). Angular est utilisé côté Front et constitue la base de ce projet (si on le remplace, on est plus sur le même type de projet). \n2_ Angular UI Router se charge des routes de l'application. Il pourrait être remplacer par NgRoute, mais avec certaines limitations : gestion des  vues imbriquées, génération des liens, ...\n3_ Express est un framework qui facilite l'utilisation de NodeJs en gérant les routes et en facilitant l'utilisation de template. On pourrait s'en passer en gérant tout ça en javascript mais on ne serait plus dans un projet MEAN Stack\n4_ JSONWebToken est un standard permettant l'échane de données grâce à un token (jeton). Son intérêt n'existe que pour des échanges entre sites distants (authentification entre notre site et facebook par exemple). Nous pouvons donc ici nous en passer.\n5_ Mongoose est un module Node qui permet d'utiliser le système de base de données MongoDB. Il est ici indispensable.\n6_ MaterializeCSS est un framework CSS que nous pourrions par exemple remplacer par Bootstrap.\n7_ Passport est une bibiothèque qui gère l'authentification. Il est particulièrement utile pour gérer l'authentification avec des applications tierces, ce qui n'est pas le cas ici. Nous pourrions éventuelllement faire différemment.\n8_ Babel est un transpilateur qui permet de fournir un code ES5 aux navigateurs qui ne comprennent pas ES6. Indispensable.\n9_ SCSS est un langage qui fournit (une fois interprêté) du CSS. On peut s'en passer mais son utilisation est un gain de temps appréciable pour qui le maîtrise. \n10_ Nodemon permet de relancer le server quand un fichier est modifié. C'est pratique mais on peut s'en passer.\n11_ Webpack est un task runner qui permet de manager les ressources du projet. On peut s'en passer éventuelllement.\n---\nLa MEAN Stack représente l'assemblage de Mongo Express Angular et Node.","__v":0}
{"_id":{"$oid":"5909ac18bb91e52047c14543"},"updatedAt":{"$date":"2017-05-03T10:08:24.598Z"},"createdAt":{"$date":"2017-05-03T10:08:24.598Z"},"publishedAt":{"$date":"2017-05-03T22:00:00.000Z"},"title":"Mon titre","content":"Mon contenu","__v":0}
{"_id":{"$oid":"5909b589f853112614eaa060"},"updatedAt":{"$date":"2017-05-03T10:48:41.732Z"},"createdAt":{"$date":"2017-05-03T10:48:41.732Z"},"publishedAt":{"$date":"2017-05-02T22:00:00.000Z"},"title":"Mon article publié","content":"OUI","published":true,"__v":0}
{"_id":{"$oid":"5909b59ff853112614eaa061"},"updatedAt":{"$date":"2017-05-03T10:49:03.372Z"},"createdAt":{"$date":"2017-05-03T10:49:03.372Z"},"publishedAt":{"$date":"2017-05-13T22:00:00.000Z"},"title":"Mon article pas publié","content":"NON","published":false,"__v":0}
